## Pandas basic
* https://pandas.pydata.org/
* https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf
* [10 minutes to pandas](https://pandas.pydata.org/pandas-docs/version/1.0.0/getting_started/10min.html)

In [1]:
import pandas as pd

## DataFrame

In [2]:
# 공식문서(도움말) 활용하기
# pd.DataFrame?
# pd.DataFrame(shift+tab+tab)

df = pd.DataFrame(
{"a" : [4 ,5, 6, 4],
"b" : [7, 8, 9, 9],
"c" : [10, 11, 12, 10]},
index = [1, 2, 3, 4])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  4  9  10

## Series

In [3]:
df["a"]

1    4
2    5
3    6
4    4
Name: a, dtype: int64

In [4]:
# dataframe
df[["a"]]

   a
1  4
2  5
3  6
4  4

## Subset

In [5]:
df[df["a"] > 4]

   a  b   c
2  5  8  11
3  6  9  12

In [6]:
df["a"]

1    4
2    5
3    6
4    4
Name: a, dtype: int64

In [7]:
df[["a", "b"]]

   a  b
1  4  7
2  5  8
3  6  9
4  4  9

## Summarize Data

In [8]:
df["a"].value_counts()

4    2
6    1
5    1
Name: a, dtype: int64

In [9]:
len(df)

4

## Reshaping

## sort_values, drop

In [10]:
df.sort_values("a", ascending=False)

   a  b   c
3  6  9  12
2  5  8  11
1  4  7  10
4  4  9  10

In [11]:
df = df.drop(["c"], axis=1)
df

   a  b
1  4  7
2  5  8
3  6  9
4  4  9

## Group Data
## Groupby, pivot_table

In [12]:
df.groupby(["a"])["b"].agg(["mean", "sum", "count"])

   mean  sum  count
a
4     8   16      2
5     8    8      1
6     9    9      1

In [13]:
df.groupby(["a"])["b"].describe()

   count  mean       std  min  25%  50%  75%  max
a
4    2.0   8.0  1.414214  7.0  7.5  8.0  8.5  9.0
5    1.0   8.0       NaN  8.0  8.0  8.0  8.0  8.0
6    1.0   9.0       NaN  9.0  9.0  9.0  9.0  9.0

In [14]:
df

   a  b
1  4  7
2  5  8
3  6  9
4  4  9

In [15]:
pd.pivot_table(df, index="a", values="b", aggfunc="sum")

    b
a
4  16
5   8
6   9

## Plotting

In [ ]:
df.plot.density()